trust/trunk/src/dk/itst/oiosaml/trust/req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="i6Ybudy5_gaCaI4ggdRCzETK43b0">http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue</wsa:Action>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			soap:mustUnderstand="1">
			<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="ieEH_HCtsm_c4sozdn_lgSqFwAJM">
				<wsu:Created>2008-07-25T08:13:03.519Z</wsu:Created>
				<wsu:Expires>2008-07-25T08:18:03.519Z</wsu:Expires>
			</wsu:Timestamp>
			<saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" ID="_abdb3855-ce87-49ec-a378-2a86ccb82537"
				IssueInstant="2008-07-25T08:12:58.872Z" Version="2.0">
				<saml:Issuer>idp1.test.oio.dk</saml:Issuer>
				<saml:Subject>
					<saml:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">joetest</saml:NameID>
					<saml:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer">
						<saml:SubjectConfirmationData NotOnOrAfter="2008-07-25T09:12:58.872Z"
							Recipient="http://jre-mac.trifork.com:8080/saml/saml/SAMLAssertionConsumer" />
					</saml:SubjectConfirmation>
				</saml:Subject>
				<saml:Conditions NotBefore="2008-07-25T08:12:58.872Z" NotOnOrAfter="2008-07-25T09:12:58.872Z">
					<saml:AudienceRestriction>
						<saml:Audience>tri-test1.trifork.com</saml:Audience>
					</saml:AudienceRestriction>
				</saml:Conditions>
				<saml:AuthnStatement AuthnInstant="2008-07-25T08:12:58.872Z">
					<saml:AuthnContext>
						<saml:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:Password
						</saml:AuthnContextClassRef>
					</saml:AuthnContext>
				</saml:AuthnStatement>
				<saml:AttributeStatement>
					<saml:Attribute Name="urn:oid:0.9.2342.19200300.100.1.3" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue>null</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="urn:oid:2.5.4.3" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue>null</saml:AttributeValue>
					</saml:Attribute>
					<saml:Attribute Name="dk:gov:saml:attribute:AssuranceLevel" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue>3</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
			</saml:Assertion>
			<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
					<ds:Reference URI="#ivSPBmIFWCpWfifLNTHz9_pCmLpM">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>1QImEAztY5dK2SyXgkePnPLW16w=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#i6Ybudy5_gaCaI4ggdRCzETK43b0">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>qI1CpTEUTeE237wXmlFA+k7VR40=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#ieEH_HCtsm_c4sozdn_lgSqFwAJM">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>619AaSjxEoGxMjK1AILFOPGWqFM=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue> Q/Z/1pEdcaLNgaEZysxm5qO6VoRqWv0ZSDta2Cl+XJIdOid4PE1sAY5C1FzNLkdtDOlt9XRMYOVr
					RQWAl/kCTclCAbFSvcYLr/IzVEkv3ZdPyEWDFQz4qPe+dcxXPaxp1VkNYTzK4n2rYFasGfqcSlMj KnlN4/amzJ2pVfbcBYg=</ds:SignatureValue>
				<ds:KeyInfo>
					<wsse:SecurityTokenReference>
						<wsse:Reference URI="" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" />
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
	</soap:Header>
	<soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="ivSPBmIFWCpWfifLNTHz9_pCmLpM">
		<wst:RequestSecurityToken xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512/">
			<wst:TokenType>http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0
			</wst:TokenType>
			<wst:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue
			</wst:RequestType>
			<wsp:AppliesTo xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy">
				<wsa:EndpointReference xmlns:wsa="http://www.w3.org/2005/08/addressing">
					<wsa:Address>http://jre-mac.trifork.com</wsa:Address>
				</wsa:EndpointReference>
			</wsp:AppliesTo>
			<wst:OnBehalfOf>
				<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
					xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
					<wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">_abdb3855-ce87-49ec-a378-2a86ccb82537
					</wsse:KeyIdentifier>
				</wsse:SecurityTokenReference>
			</wst:OnBehalfOf>
		</wst:RequestSecurityToken>
	</soap:Body>
</soap:Envelope>